dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Serial.h
/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define _CE00_UART0_RECEIVE_DIVISOR      (0xCE00U)
#define _CE00_UART0_TRANSMIT_DIVISOR     (0xCE00U)

/*串行阵列单元*/
typedef enum RL78G13_SERIAL_UNIT
{
    RL78G13_SERIAL_UNIT_0 = 0,
    RL78G13_SERIAL_UNIT_1 = 1,
}RL78G13_SERIAL_UNIT;

/*串行阵列通道,单元0有四个通道,单元1有两个通道*/
typedef enum RK78G13_SERIAL_UNIT_CHANNEL
{
    RK78G13_SERIAL_UNIT_CHANNEL_0 = 0,
    RK78G13_SERIAL_UNIT_CHANNEL_1 = 1,
    RK78G13_SERIAL_UNIT_CHANNEL_2 = 2,
    RK78G13_SERIAL_UNIT_CHANNEL_3 = 3,
}RK78G13_SERIAL_UNIT_CHANNEL;

/*串行时钟选择寄存器SPS*/
/*单元时钟0,基于FCLK的分频*/
#define RL78G13_SERIAL_SPS_FLCK0_MASK                                       0X000FU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_1                                      0X0000U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_2                                      0X0001U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_4                                      0X0002U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_8                                      0X0003U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_16                                     0X0004U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_32                                     0X0005U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_64                                     0X0006U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_128                                    0X0007U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_256                                    0X0008U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_512                                    0X0009U
#define RL78G13_SERIAL_SPS_FLCK0_DIV_1024                                   0X000AU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_2048                                   0X000BU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_4096                                   0X000CU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_8192                                   0X000DU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_16384                                  0X000EU
#define RL78G13_SERIAL_SPS_FLCK0_DIV_32768                                  0X000FU

/*单元时钟1,基于FCLK的分频*/
#define RL78G13_SERIAL_SPS_FLCK1_MASK                                       0X00F0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_1                                      0X0000U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_2                                      0X0010U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_4                                      0X0020U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_8                                      0X0030U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_16                                     0X0040U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_32                                     0X0050U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_64                                     0X0060U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_128                                    0X0070U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_256                                    0X0080U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_512                                    0X0090U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_1024                                   0X00A0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_2048                                   0X00B0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_4096                                   0X00C0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_8192                                   0X00D0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_16384                                  0X00E0U
#define RL78G13_SERIAL_SPS_FLCK1_DIV_32768                                  0X00F0U


/*串行模式寄存器SMR*/
/*通道N的操作时钟FMCK的选择,单元时钟0或者1*/
#define RL78G13_SERIAL_SMR_FMCK_SELECT_MASK                                 0X8000U
#define RL78G13_SERIAL_SMR_FMCK_SELECT_FCLK0                                0X0000U
#define RL78G13_SERIAL_SMR_FMCK_SELECT_FCLK1                                0X8000U

/*通道N的传送时钟FTCLK的选择,FMCK或者引脚输入时钟*/
#define RL78G13_SERIAL_SMR_FTCLK_SELECT_MASK                                0X4000U
#define RL78G13_SERIAL_SMR_FTCLK_SELECT_FMCK                                0X0000U
#define RL78G13_SERIAL_SMR_FTCLK_SELECT_FSCK                                0X4000U

/*开始触发源的选择,软件触发或者RXDQ有效沿触发*/
#define RL78G13_SERIAL_SMR_START_TRIG_SOURCE_MASK                           0X0100U
#define RL78G13_SERIAL_SMR_START_TRIG_SOURCE_SOFT                           0X0000U
#define RL78G13_SERIAL_SMR_START_TRIG_SOURCE_RXDQ_PIN                       0X0100U

/*串口模式下,接收电平的反向控制,下降沿起始位还是上升沿起始位*/
#define RL78G13_SERIAL_SMR_UART_RECV_START_LEVEL_MASK                       0X0040U
#define RL78G13_SERIAL_SMR_UART_RECV_START_LEVEL_FALLING                    0X0000U
#define RL78G13_SERIAL_SMR_UART_RECV_START_LEVEL_RISING                     0X0040U

/*通道的使用模式,CSI模式 UART模式 简易IIC模式*/
#define RL78G13_SERIAL_SMR_CHANNEL_MODE_MASK                                0X0006U
#define RL78G13_SERIAL_SMR_CHANNEL_MODE_CSI                                 0X0000U
#define RL78G13_SERIAL_SMR_CHANNEL_MODE_UART                                0X0002U
#define RL78G13_SERIAL_SMR_CHANNEL_MODE_IIC                                 0X0004U

/*通道N的中断源的选择,传送结束发生中断还是缓冲区空发生中断*/
#define RL78G13_SERIAL_SMR_INT_SRC_MASK                                     0X0001U
#define RL78G13_SERIAL_SMR_INT_SRC_END                                      0X0000U
#define RL78G13_SERIAL_SMR_INT_SRC_EMPTY                                    0X0001U


/*串行通讯操作设置寄存器SCR*/
/*通道N的操作模式设定,禁止通讯,仅接受,仅发送,同时发送接收*/
#define RL78G13_SERIAL_SCR_MODE_MASK                                        0XC000U
#define RL78G13_SERIAL_SCR_MODE_DISABLE                                     0X0000U
#define RL78G13_SERIAL_SCR_MODE_RX_ONLY                                     0X4000U
#define RL78G13_SERIAL_SCR_MODE_TX_ONLY                                     0X8000U
#define RL78G13_SERIAL_SCR_MODE_TX_RX                                       0XC000U

/*CSI模式下数据和时钟相位的选择,一共四种模式,具体看文档*/
#define RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_MASK                             0X3000U
#define RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_0                                0X0000U
#define RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_1                                0X1000U
#define RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_2                                0X2000U
#define RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_3                                0X3000U

