dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Serial.h
/*选择是否屏蔽错误中断信号*/
#define RL78G13_SERIAL_SCR_INT_DISABLE_MASK                                 0X0400U
#define RL78G13_SERIAL_SCR_INT_DISABLE_ON                                   0X0000U
#define RL78G13_SERIAL_SCR_INT_DISABLE_OFF                                  0X0400U

/*UART模式下的奇偶校验选择*/
#define RL78G13_SERIAL_SCR_UART_CHECK_MASK                                  0X0300U
/*发送模式下的奇偶校验,分为不输出,0校验,奇校验,偶校验*/
#define RL78G13_SERIAL_SCR_UART_CHECK_TX_NONE                               0X0000U
#define RL78G13_SERIAL_SCR_UART_CHECK_TX_ZERO                               0X0100U
#define RL78G13_SERIAL_SCR_UART_CHECK_TX_ODD                                0X0200U
#define RL78G13_SERIAL_SCR_UART_CHECK_TX_EVEN                               0X0300U
/*接受模式下的奇偶校验,分为无校验,奇校验,偶校验*/
#define RL78G13_SERIAL_SCR_UART_CHECK_RX_NO                                 0X0000U
#define RL78G13_SERIAL_SCR_UART_CHECK_RX_NO1                                0X0100U
#define RL78G13_SERIAL_SCR_UART_CHECK_RX_ODD                                0X0200U
#define RL78G13_SERIAL_SCR_UART_CHECK_RX_EVEN                               0X0300U

/*CSI和UART模式下的数据传送序列选择,分为MSB优先和LSB优先*/
#define RL78G13_SERIAL_SCR_UART_CSI_SEQ_MASK                                0X0080U
#define RL78G13_SERIAL_SCR_UART_CSI_SEQ_MSB_FIRST                           0X0000U
#define RL78G13_SERIAL_SCR_UART_CSI_SEQ_LSB_FIRST                           0X0080U

/*UART模式下的停止位长度选择,分为0长度 1长度 2长度*/
#define RL78G13_SERIAL_SCR_UART_STOP_BITS_MASK                              0X0030U
#define RL78G13_SERIAL_SCR_UART_STOP_BITS_NONE                              0X0000U
#define RL78G13_SERIAL_SCR_UART_STOP_BITS_1                                 0X0010U
#define RL78G13_SERIAL_SCR_UART_STOP_BITS_2                                 0X0020U

/*CSI和UART模式下的数据长度选择,分为9 8 7长度*/
#define RL78G13_SERIAL_SCR_UART_CSI_DATALENGTH_MASK                         0X0003U
#define RL78G13_SERIAL_SCR_UART_CSI_DATALENGTH_9                            0X0001U
#define RL78G13_SERIAL_SCR_UART_CSI_DATALENGTH_7                            0X0002U
#define RL78G13_SERIAL_SCR_UART_CSI_DATALENGTH_8                            0X0003U


/*串行数据寄存器,高八位为二级分频,低八位为数据缓冲区SDR*/
/*分频公式为 FMCK/(SDR+1)*/
#define RL78G13_SERIAL_SDR_FMCK_DIV_MASK                                    0XFE00U
#define RL78G13_SERIAL_SDR_FMCK_DIV_2                                       0X0000U
#define RL78G13_SERIAL_SDR_FMCK_DIV_4                                       0X0200U
#define RL78G13_SERIAL_SDR_FMCK_DIV_6                                       0X0400U
#define RL78G13_SERIAL_SDR_FMCK_DIV_8                                       0X0600U
#define RL78G13_SERIAL_SDR_FMCK_DIV_254                                     0XFD00U
#define RL78G13_SERIAL_SDR_FMCK_DIV_256                                     0XFE00U

/*SDR中的数据掩码*/
#define RL78G13_SERIAL_SDR_DATA_MASK                                        0X00FFU


/*串行标志清除触发寄存器,清除通道N各个错误标志SIR*/
/*帧错误标志清除*/
#define RL78G13_SERIAL_SIR_FECT_MASK                                        0X0004U
#define RL78G13_SERIAL_SIR_FECT_CLECR                                       0X0004U
#define RL78G13_SERIAL_SIR_FECT_NONE                                        0X0000U

/*奇偶校验错误标志清除*/
#define RL78G13_SERIAL_SIR_PECT_MASK                                        0X0002U
#define RL78G13_SERIAL_SIR_PECT_CLECR                                       0X0002U
#define RL78G13_SERIAL_SIR_PECT_NONE                                        0X0000U

/*溢出错误标志清除*/
#define RL78G13_SERIAL_SIR_OVCT_MASK                                        0X0001U
#define RL78G13_SERIAL_SIR_OVCT_CLECR                                       0X0001U
#define RL78G13_SERIAL_SIR_OVCT_NONE                                        0X0000U


/*串行状态寄存器SSR,指示通讯状态和错误状态,只读*/
/*通讯正在进行或者已经停止或暂停*/
#define RL78G13_SERIAL_SSR_TSF_MASK                                         0X0040U
#define RL78G13_SERIAL_SSR_TSF_RUNNING                                      0X0040U
#define RL78G13_SERIAL_SSR_TSF_STOP_PAUSE                                   0X0000U

/*有效数据是否保存在SDR中*/
#define RL78G13_SERIAL_SSR_BUFFER_MASK                                      0X0020U
#define RL78G13_SERIAL_SSR_BUFFER_FULL                                      0X0020U
#define RL78G13_SERIAL_SSR_BUFFER_EMPTY                                     0X0000U

/*帧错误标志*/
#define RL78G13_SERIAL_SSR_RECV_ERR_FLAG_MASK                               0X0004U
#define RL78G13_SERIAL_SSR_RECV_ERR_FLAG_ON                                 0X0004U
#define RL78G13_SERIAL_SSR_RECV_ERR_FLAG_NONE                               0X0000U

/*奇偶校验,ACK错误检测标志*/
#define RL78G13_SERIAL_SSR_CHECK_ERR_FLAG_MASK                              0X0002U
#define RL78G13_SERIAL_SSR_CHECK_ERR_FLAG_ON                                0X0002U
#define RL78G13_SERIAL_SSR_CHECK_ERR_FLAG_NONE                              0X0000U

/*溢出错误检测标志*/
#define RL78G13_SERIAL_SSR_OVER_ERR_FLAG_MASK                               0X0001U
#define RL78G13_SERIAL_SSR_OVER_ERR_FLAG_ON                                 0X0001U
#define RL78G13_SERIAL_SSR_OVER_ERR_FLAG_NONE                               0X0000U


/*串行通道开始寄存器,SS,设置通道允许,开始通讯的触发寄存器*/
/*通道0进入通讯等待状态*/
#define RL78G13_SERIAL_SS_COM0_WAIT_FLAG_MASK                               0X0001U
#define RL78G13_SERIAL_SS_COM0_WAIT_FLAG_ON                                 0X0001U
#define RL78G13_SERIAL_SS_COM0_WAIT_FLAG_OFF                                0X0000U

/*通道1进入通讯等待状态*/
#define RL78G13_SERIAL_SS_COM1_WAIT_FLAG_MASK                               0X0002U
#define RL78G13_SERIAL_SS_COM1_WAIT_FLAG_ON                                 0X0002U
#define RL78G13_SERIAL_SS_COM1_WAIT_FLAG_OFF                                0X0000U

/*通道2进入通讯等待状态*/
#define RL78G13_SERIAL_SS_COM2_WAIT_FLAG_MASK                               0X0004U
#define RL78G13_SERIAL_SS_COM2_WAIT_FLAG_ON                                 0X0004U
#define RL78G13_SERIAL_SS_COM2_WAIT_FLAG_OFF                                0X0000U

/*通道3进入通讯等待状态*/
#define RL78G13_SERIAL_SS_COM3_WAIT_FLAG_MASK                               0X0008U
#define RL78G13_SERIAL_SS_COM3_WAIT_FLAG_ON                                 0X0008U
#define RL78G13_SERIAL_SS_COM3_WAIT_FLAG_OFF                                0X0000U

