dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Serial.h
/*串行通道停止寄存器ST,设置通道禁止,停止通讯的触发寄存器*/
/*通道0停止通讯操作*/
#define RL78G13_SERIAL_ST_COM0_STOP_FLAG_MASK                               0X0001U
#define RL78G13_SERIAL_ST_COM0_STOP_FLAG_ON                                 0X0001U
#define RL78G13_SERIAL_ST_COM0_STOP_FLAG_OFF                                0X0000U

/*通道1停止通讯操作*/
#define RL78G13_SERIAL_ST_COM1_STOP_FLAG_MASK                               0X0002U
#define RL78G13_SERIAL_ST_COM1_STOP_FLAG_ON                                 0X0002U
#define RL78G13_SERIAL_ST_COM1_STOP_FLAG_OFF                                0X0000U

/*通道2停止通讯操作*/
#define RL78G13_SERIAL_ST_COM2_STOP_FLAG_MASK                               0X0004U
#define RL78G13_SERIAL_ST_COM2_STOP_FLAG_ON                                 0X0004U
#define RL78G13_SERIAL_ST_COM2_STOP_FLAG_OFF                                0X0000U

/*通道3停止通讯操作*/
#define RL78G13_SERIAL_ST_COM3_STOP_FLAG_MASK                               0X0008U
#define RL78G13_SERIAL_ST_COM3_STOP_FLAG_ON                                 0X0008U
#define RL78G13_SERIAL_ST_COM3_STOP_FLAG_OFF                                0X0000U


/*串行通道允许状态寄存器,SE,显示的就是SS和ST的设置结果,只读*/
/*通道0允许操作或者停止操作*/
#define RL78G13_SERIAL_SE_COM0_ALLOW_OP_FLAG_MASK                           0X0001U
#define RL78G13_SERIAL_SE_COM0_ALLOW_OP_FLAG_ON                             0X0001U
#define RL78G13_SERIAL_SE_COM0_ALLOW_OP_FLAG_OFF                            0X0000U

/*通道1允许操作或者停止操作*/
#define RL78G13_SERIAL_SE_COM1_ALLOW_OP_FLAG_MASK                           0X0002U
#define RL78G13_SERIAL_SE_COM1_ALLOW_OP_FLAG_ON                             0X0002U
#define RL78G13_SERIAL_SE_COM1_ALLOW_OP_FLAG_OFF                            0X0000U

/*通道2允许操作或者停止操作*/
#define RL78G13_SERIAL_SE_COM2_ALLOW_OP_FLAG_MASK                           0X0004U
#define RL78G13_SERIAL_SE_COM2_ALLOW_OP_FLAG_ON                             0X0004U
#define RL78G13_SERIAL_SE_COM2_ALLOW_OP_FLAG_OFF                            0X0000U

/*通道3允许操作或者停止操作*/
#define RL78G13_SERIAL_SE_COM3_ALLOW_OP_FLAG_MASK                           0X0008U
#define RL78G13_SERIAL_SE_COM3_ALLOW_OP_FLAG_ON                             0X0008U
#define RL78G13_SERIAL_SE_COM3_ALLOW_OP_FLAG_OFF                            0X0000U


/*串行输出允许寄存器SOE,设置是否允许各个串行通道的输出*/
/*通道0允许或者停止串行通道的输出*/
#define RL78G13_SERIAL_SOE_COM0_OUTPUT_ENABLE_FLAG_MASK                     0X0001U
#define RL78G13_SERIAL_SOE_COM0_OUTPUT_ENABLE_FLAG_ON                       0X0001U
#define RL78G13_SERIAL_SOE_COM0_OUTPUT_ENABLE_FLAG_OFF                      0X0000U

/*通道1允许或者停止串行通道的输出*/
#define RL78G13_SERIAL_SOE_COM1_OUTPUT_ENABLE_FLAG_MASK                     0X0002U
#define RL78G13_SERIAL_SOE_COM1_OUTPUT_ENABLE_FLAG_ON                       0X0002U
#define RL78G13_SERIAL_SOE_COM1_OUTPUT_ENABLE_FLAG_OFF                      0X0000U

/*通道2允许或者停止串行通道的输出*/
#define RL78G13_SERIAL_SOE_COM2_OUTPUT_ENABLE_FLAG_MASK                     0X0004U
#define RL78G13_SERIAL_SOE_COM2_OUTPUT_ENABLE_FLAG_ON                       0X0004U
#define RL78G13_SERIAL_SOE_COM2_OUTPUT_ENABLE_FLAG_OFF                      0X0000U

/*通道3允许或者停止串行通道的输出*/
#define RL78G13_SERIAL_SOE_COM3_OUTPUT_ENABLE_FLAG_MASK                     0X0008U
#define RL78G13_SERIAL_SOE_COM3_OUTPUT_ENABLE_FLAG_ON                       0X0008U
#define RL78G13_SERIAL_SOE_COM3_OUTPUT_ENABLE_FLAG_OFF                      0X0000U

/*串行输出寄存器SO,用于各个通道串行输出的缓冲,控制串行时钟的输出和数据的输出*/
/*SE启用时,软件改写将被忽略,手动单比特传送有用*/
/*通道0时钟输出0或1*/
#define RL78G13_SERIAL_SO_COM0_CLOCK_OUTPUT_MASK                            0X0100U
#define RL78G13_SERIAL_SO_COM0_CLOCK_OUTPUT_1                               0X0100U
#define RL78G13_SERIAL_SO_COM0_CLOCK_OUTPUT_0                               0X0000U

/*通道1时钟输出0或1*/
#define RL78G13_SERIAL_SO_COM1_CLOCK_OUTPUT_MASK                            0X0200U
#define RL78G13_SERIAL_SO_COM1_CLOCK_OUTPUT_1                               0X0200U
#define RL78G13_SERIAL_SO_COM1_CLOCK_OUTPUT_0                               0X0000U

/*通道2时钟输出0或1*/
#define RL78G13_SERIAL_SO_COM2_CLOCK_OUTPUT_MASK                            0X0400U
#define RL78G13_SERIAL_SO_COM2_CLOCK_OUTPUT_1                               0X0400U
#define RL78G13_SERIAL_SO_COM2_CLOCK_OUTPUT_0                               0X0000U

/*通道3时钟输出0或1*/
#define RL78G13_SERIAL_SO_COM3_CLOCK_OUTPUT_MASK                            0X0800U
#define RL78G13_SERIAL_SO_COM3_CLOCK_OUTPUT_1                               0X0800U
#define RL78G13_SERIAL_SO_COM3_CLOCK_OUTPUT_0                               0X0000U

/*通道0数据输出0或1*/
#define RL78G13_SERIAL_SO_COM0_DATA_OUTPUT_MASK                             0X0001U
#define RL78G13_SERIAL_SO_COM0_DATA_OUTPUT_1                                0X0001U
#define RL78G13_SERIAL_SO_COM0_DATA_OUTPUT_0                                0X0000U

/*通道1数据输出0或1*/
#define RL78G13_SERIAL_SO_COM1_DATA_OUTPUT_MASK                             0X0002U
#define RL78G13_SERIAL_SO_COM1_DATA_OUTPUT_1                                0X0002U
#define RL78G13_SERIAL_SO_COM1_DATA_OUTPUT_0                                0X0000U

/*通道2数据输出0或1*/
#define RL78G13_SERIAL_SO_COM2_DATA_OUTPUT_MASK                             0X0004U
#define RL78G13_SERIAL_SO_COM2_DATA_OUTPUT_1                                0X0004U
#define RL78G13_SERIAL_SO_COM2_DATA_OUTPUT_0                                0X0000U

/*通道3数据输出0或1*/
#define RL78G13_SERIAL_SO_COM3_DATA_OUTPUT_MASK                             0X0008U
#define RL78G13_SERIAL_SO_COM3_DATA_OUTPUT_1                                0X0008U
#define RL78G13_SERIAL_SO_COM3_DATA_OUTPUT_0                                0X0000U


/*串行输出电平寄存器SOL.数据电平是否反向*/
/*通道0输出数据是否反向*/
#define RL78G13_SERIAL_SOL_COM0_OUTPUT_REVERSE_FLAG_MASK                    0X0001U
#define RL78G13_SERIAL_SOL_COM0_OUTPUT_REVERSE_FLAG_ON                      0X0001U
#define RL78G13_SERIAL_SOL_COM0_OUTPUT_REVERSE_FLAG_OFF                     0X0000U

/*通道2输出数据是否反向*/
#define RL78G13_SERIAL_SOL_COM2_OUTPUT_REVERSE_FLAG_MASK                    0X0004U
#define RL78G13_SERIAL_SOL_COM2_OUTPUT_REVERSE_FLAG_ON                      0X0004U
#define RL78G13_SERIAL_SOL_COM2_OUTPUT_REVERSE_FLAG_OFF                     0X0000U


/*串行待机控制寄存器SSC,设置通过接受UART0或者CSI0的串行数据,控制STOP模式下启动接收*/
/*使用或者不使用SNOOZE模式*/
#define RL78G13_SERIAL_SSC_SNOOZE_ENABLE_MASK                               0X0001U
#define RL78G13_SERIAL_SSC_SNOOZE_ENABLE_FLAG                               0X0001U
#define RL78G13_SERIAL_SSC_SNOOZE_DISABLE_FLAG                              0X0000U

/*允许或者停止传送结束中断*/
#define RL78G13_SERIAL_SSC_INT_ERR_ENABLE_MASK                              0X0002U
#define RL78G13_SERIAL_SSC_INT_ERR_ENABLE_FLAG                              0X0002U
#define RL78G13_SERIAL_SSC_INT_ERR_DISABLE_FLAG                             0X0000U


/*输入切换控制寄存器ISC,用于切换定时器阵列7和RXD2的交替模式,主要在LIN模式使用*/
/*TI07使用正常的YI07引脚还是使用RXD2引脚*/
#define RL78G13_SERIAL_ISC_TIMER7_INPUT_MASK                                0X01U
#define RL78G13_SERIAL_ISC_TIMER7_INPUT_RXD2                                0X01U
#define RL78G13_SERIAL_ISC_TIMER7_INPUT_NORMAL                              0X00U

/*外部中断INTP0使用正常的INTP0引脚还是使用RXD2引脚*/
#define RL78G13_SERIAL_ISC_INTP0_INPUT_MASK                                 0X02U
#define RL78G13_SERIAL_ISC_INTP0_INPUT_RXD2                                 0X02U
#define RL78G13_SERIAL_ISC_INTP0_INPUT_NORMAL                               0X00U


/*噪声滤波器允许寄存器NFEN,用于控制RX引脚的噪声滤波功能的开关*/
/*RXD0引脚噪声滤波器开启或者关闭*/
#define RL78G13_SERIAL_NFEN_RXD0_NOIZE_FILTER_MASK                          0X01U
#define RL78G13_SERIAL_NFEN_RXD0_NOIZE_FILTER_OPEN                          0X01U
#define RL78G13_SERIAL_NFEN_RXD0_NOIZE_FILTER_CLOSE                         0X00U

/*RXD1引脚噪声滤波器开启或者关闭*/
#define RL78G13_SERIAL_NFEN_RXD1_NOIZE_FILTER_MASK                          0X04U
#define RL78G13_SERIAL_NFEN_RXD1_NOIZE_FILTER_OPEN                          0X04U
#define RL78G13_SERIAL_NFEN_RXD1_NOIZE_FILTER_CLOSE                         0X00U

/*RXD2引脚噪声滤波器开启或者关闭*/
#define RL78G13_SERIAL_NFEN_RXD2_NOIZE_FILTER_MASK                          0X10U
#define RL78G13_SERIAL_NFEN_RXD2_NOIZE_FILTER_OPEN                          0X10U
#define RL78G13_SERIAL_NFEN_RXD2_NOIZE_FILTER_CLOSE                         0X00U

/*RXD3引脚噪声滤波器开启或者关闭*/
#define RL78G13_SERIAL_NFEN_RXD3_NOIZE_FILTER_MASK                          0X40U
#define RL78G13_SERIAL_NFEN_RXD3_NOIZE_FILTER_OPEN                          0X40U
#define RL78G13_SERIAL_NFEN_RXD3_NOIZE_FILTER_CLOSE                         0X00U



/*源文件API设定*/

/*SPS*/
void RL78G13_SerialSPSWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t fclk0Div, uint16_t fclk1Div);
void RL78G13_SerialSPSWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSPSReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSPSReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*SMR*/
void RL78G13_SerialSMRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t FMCKSelect, uint16_t FTCLKSelect, uint16_t startTrigSourceSelect, uint16_t uartRecvStartLevel,
    uint16_t channelMode, uint16_t intSrcSelect);
void RL78G13_SerialSMRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel);
uint16_t RL78G13_SerialReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask);


