dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Serial.h
/*SCR*/
void RL78G13_SerialSCRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t txrxMode, uint16_t csiSingalType, uint16_t errorShield, uint16_t txrxCheckMode,
    uint16_t firstBitSet, uint16_t stopBitsSet, uint16_t dataLengthSet);
void RL78G13_SerialSCRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSCRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel);
uint16_t RL78G13_SerialSCRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask);


/*SDR*/
void RL78G13_SerialSDRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t fmclkDiv, uint16_t sendData);
void RL78G13_SerialSDRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSDRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel);
uint16_t RL78G13_SerialSDRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask);


/*SIR*/
void RL78G13_SerialSIRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t frameErrClear, uint16_t checkErrClear, uint16_t overFlowErrClear);
void RL78G13_SerialSIRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSIRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel);
uint16_t RL78G13_SerialSIRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask);


/*SSR*/
uint16_t RL78G13_SerialSSRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel);
uint16_t RL78G13_SerialSSRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask);


/*SS*/
void RL78G13_SerialSSWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Wait, uint16_t com1Wait,
    uint16_t com2Wait, uint16_t com3Wait);
void RL78G13_SerialSSWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSSReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSSReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*ST*/
void RL78G13_SerialSTWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Stop, uint16_t com1Stop,
    uint16_t com2Stop, uint16_t com3Stop);
void RL78G13_SerialSTWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSTReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSTReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*SE*/
uint16_t RL78G13_SerialSEReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);



/*SOE*/
void RL78G13_SerialSOEWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0AllowOP,
    uint16_t com1AllowOP, uint16_t com2AllowOP, uint16_t com3AllowOP);
void RL78G13_SerialSOEWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSOEReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSOEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*SO*/
void RL78G13_SerialSOWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t clock0OutValue,
    uint16_t clock1OutValue, uint16_t clock2OutValue, uint16_t clock3OutValue,
    uint16_t data0OutValue, uint16_t data1OutValue, uint16_t data2OutValue,
    uint16_t data3OutValue);
void RL78G13_SerialSOWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSOReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSOReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*SOL*/
void RL78G13_SerialSOLWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t tx0LevelReserve,
    uint16_t tx2LevelReserve);
void RL78G13_SerialSOLWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSOLReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSOLReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*SSC*/
void RL78G13_SerialSSCWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t errIntEnable,
    uint16_t snoozeEnable);
void RL78G13_SerialSSCWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value);
uint16_t RL78G13_SerialSSCReadAll(RL78G13_SERIAL_UNIT unit);
uint16_t RL78G13_SerialSSCReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask);


/*ISC*/
void RL78G13_SerialISCWriteAll(uint8_t timer7Switch, uint8_t intp0Switch);
void RL78G13_SerialISCWriteOne(uint16_t mask, uint8_t value);
uint8_t RL78G13_SerialISCReadAll(void);
uint8_t RL78G13_SerialISCReadOne(uint16_t mask);


/*NFEN*/
void RL78G13_SerialNFENWriteAll(uint8_t rxd0FilterEnable, uint8_t rxd1FilterEnable,
    uint8_t rxd2FilterEnable, uint8_t rxd3FilterEnable);
void RL78G13_SerialNFENWriteOne(uint16_t mask, uint8_t value);
uint16_t RL78G13_SerialNFENReadAll();
uint16_t RL78G13_SerialNFENReadOne(uint16_t mask);



#endif





